{
  "backend/main.mo": "Main Motoko actor defining all core data types (UserProfile, Project, Contractor, Bill, NMR, Payment) and in-memory maps for a construction billing system, with mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Add User' button was added to the UsersPage header for admin users, referencing the relevant file and test ID.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key changes, serving as a build/change reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app at `#root` and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (index redirects to /users), wraps the app in QueryClient, ThemeProvider, and error boundary.",
  "frontend/src/components/AppShell/AppShell.tsx": "Layout wrapper combining the Sidebar with a scrollable main content area and an optional banner slot.",
  "frontend/src/components/AppShell/RoleBadge.tsx": "Badge component that displays a human-readable label and visual variant for a given UserRole enum value.",
  "frontend/src/components/AppShell/Sidebar.tsx": "Navigation sidebar showing role-filtered nav items, user profile info with RoleBadge, and a logout button using Internet Identity.",
  "frontend/src/components/CurrentInternetIdentityPanel.tsx": "Fixed bottom-right panel displaying the current Internet Identity principal with a copy-to-clipboard button.",
  "frontend/src/components/dialogs/DeleteWithPasswordDialog.tsx": "An alert dialog that requires the user to enter a password before confirming a delete action, resetting the input on cancel or confirm.",
  "frontend/src/components/FatalErrorBoundary.tsx": "React class-based error boundary that catches unhandled errors and renders a FatalErrorFallback component instead of crashing the app.",
  "frontend/src/components/FatalErrorFallback.tsx": "Displays a full-screen error card with error details and a reload button, used as a fallback UI when the application encounters an unrecoverable error.",
  "frontend/src/components/GuestModeBanner.tsx": "Renders an informational banner notifying the user they are in guest mode, with a button to trigger sign-in.",
  "frontend/src/components/ProfileStatusBanner.tsx": "Displays a status banner with loading, error, or info variants, optionally showing retry and logout action buttons for error states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, projects, contractors, bills, NMRs, and payments using the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/dates.ts": "Utility functions for adding days to a date string and formatting a date string into a localized Indian English format.",
  "frontend/src/lib/formatters/currency.ts": "Exports a single utility function that formats a number as Indian Rupee currency using the Intl.NumberFormat API.",
  "frontend/src/lib/roleAccess.ts": "Defines role-based access control helper functions and role conversion utilities for the application's UserRole enum.",
  "frontend/src/lib/units.ts": "Exports a constant array of measurement unit strings and a corresponding TypeScript type used for bill line items.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/analytics/AnalyticsPage.tsx": "Placeholder analytics page that displays a heading and a card noting that trade-wise totals, top-3 summaries, and advanced filtering features are coming soon.",
  "frontend/src/pages/bills/BillFormDialog.tsx": "Dialog form for creating a new bill, collecting project, contractor, trade, pricing, and description fields, then submitting via the useCreateBill mutation with toast feedback.",
  "frontend/src/pages/bills/BillsPage.tsx": "Main bills listing page that fetches and displays bills in a sortable table with role-based controls for raising, viewing, and deleting bills, including error and loading states.",
  "frontend/src/pages/bills/BillViewDialog.tsx": "Read-only dialog that displays full details of a selected bill including status badge, financial breakdown, and approval information for PM, QC, and billing stages.",
  "frontend/src/pages/contractors/ContractorFormDialog.tsx": "Dialog form for creating or editing a contractor record, pre-populating fields when editing and submitting via create or update mutations with validation and toast notifications.",
  "frontend/src/pages/contractors/ContractorsPage.tsx": "The main contractors list page with filtering, and actions to view, edit, and delete contractors based on user role permissions.",
  "frontend/src/pages/contractors/ContractorViewDialog.tsx": "A read-only dialog component that displays full details of a selected contractor, including contact info, pricing, and attachments.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Dashboard page showing summary statistics (total bills, completed payments, paid amounts) derived from bills and payments data, with authentication-aware rendering.",
  "frontend/src/pages/Deactivated.tsx": "Full-screen page shown to deactivated users, displaying an account deactivated message and a logout button that clears identity and query cache.",
  "frontend/src/pages/Login.tsx": "Login page component that renders a centered card with a PayGo logo and a login button using Internet Identity authentication, with an optional cancel/close callback.",
  "frontend/src/pages/nmr/NMRFormDialog.tsx": "A dialog form for creating new NMR (weekly labour records) with dynamic entry rows, auto-calculated amounts, and submission to the backend.",
  "frontend/src/pages/nmr/NMRPage.tsx": "The main NMR list page displaying weekly records with status badges, and actions to view, create, and delete NMRs based on user role.",
  "frontend/src/pages/nmr/NMRViewDialog.tsx": "A read-only dialog that displays full NMR details including a tabular breakdown of labour entries, approval statuses, and total amounts.",
  "frontend/src/pages/payments/PaymentFormDialog.tsx": "A dialog form component for recording a new payment against an approved bill, with validation and fields for bill selection, date, and amount.",
  "frontend/src/pages/payments/PaymentsPage.tsx": "The main payments list page that displays all payments in a table with role-based controls for creating, viewing, and deleting payments.",
  "frontend/src/pages/payments/PaymentViewDialog.tsx": "A read-only dialog that displays detailed information for a single payment, including amounts, status badge, project, and contractor.",
  "frontend/src/pages/ProfileLoadError.tsx": "Error page displayed when a user's profile cannot be loaded, offering a logout button that clears identity and query cache, along with possible reasons for the failure.",
  "frontend/src/pages/ProfileSetup.tsx": "Fallback page that auto-triggers a login mutation when an identity is present and shows a loading spinner; no longer used in the main flow since RootLayout handles auto-login.",
  "frontend/src/pages/projects/ProjectFormDialog.tsx": "A dialog form for creating or editing a project, handling fields like name, client, budget, addresses, and status with create/update mutations.",
  "frontend/src/pages/projects/ProjectsPage.tsx": "The main projects list page with search and status filtering, a sortable table, and role-based controls for creating, editing, viewing, and deleting projects.",
  "frontend/src/pages/projects/ProjectViewDialog.tsx": "A read-only dialog that displays full project details including addresses, budget, status badge, and clickable location links.",
  "frontend/src/pages/users/AddUserInfoDialog.tsx": "A read-only informational dialog that explains the three-step process for onboarding a new user (share link, user logs in, assign role) with no form inputs.",
  "frontend/src/pages/users/UserFormDialog.tsx": "A dialog form for editing an existing user's role and active status, using the useUpdateUser mutation to persist changes.",
  "frontend/src/pages/users/UsersPage.tsx": "The main users management page that lists all registered users in a table with view, edit, and delete actions, gated by the current user's role permissions.",
  "frontend/src/pages/users/UserViewDialog.tsx": "A read-only dialog that displays all profile details of a selected user including PayGo ID, name, email, role badge, and principal.",
  "frontend/src/routes/RootLayout.tsx": "The root layout component that handles authentication state, auto-creates user profiles on first login, shows contextual banners (guest, loading, error), and renders the AppShell with child routes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with oklch-based design tokens (colors, border radius, shadows, animations) and registering typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3), recording a known issue and pending action request to restore a missing 'Add User' button on the Users page that should open the existing AddUserInfoDialog."
}