{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Project, Contractor, Bill, NMR, Payment) and state management with Maps for users, projects, contractors, bills, NMRs, and payments, including authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the users list page to display all 7 users instead of only 2, targeting frontend/src/pages/users/UsersPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities for the PayGo billing system application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the PayGo application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, users, projects, contractors, bills, NMR, payments, and analytics, wrapped with QueryClient, ThemeProvider, and FatalErrorBoundary.",
  "frontend/src/components/AppShell/AppShell.tsx": "Layout wrapper component with fixed sidebar and scrollable main content area, supporting optional banner slot for status messages.",
  "frontend/src/components/AppShell/RoleBadge.tsx": "Badge component displaying user roles (Admin, Site Engineer, Project Manager, QC, Billing Engineer, Viewer) with role-specific styling variants.",
  "frontend/src/components/AppShell/Sidebar.tsx": "Fixed left navigation sidebar with PayGo logo, role-based menu items, active route highlighting, and conditional user profile footer with logout button shown only when authenticated.",
  "frontend/src/components/CurrentInternetIdentityPanel.tsx": "Fixed bottom-right panel displaying the current Internet Identity principal with copy-to-clipboard functionality.",
  "frontend/src/components/dialogs/DeleteWithPasswordDialog.tsx": "Alert dialog component that requires password confirmation before executing a delete action.",
  "frontend/src/components/FatalErrorBoundary.tsx": "React error boundary class component catching fatal errors and rendering FatalErrorFallback with error details.",
  "frontend/src/components/FatalErrorFallback.tsx": "Error fallback UI displaying error message in a card with reload button when fatal errors occur.",
  "frontend/src/components/GuestModeBanner.tsx": "Displays an informational banner for guest users with a sign-in button to access full features.",
  "frontend/src/components/ProfileStatusBanner.tsx": "Reusable alert banner component that displays loading, error, or info states with optional retry and logout actions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, projects, contractors, bills, NMRs, and payments with CRUD mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components and charts.",
  "frontend/src/lib/dates.ts": "Utility functions for date manipulation including adding days and formatting dates in Indian locale.",
  "frontend/src/lib/formatters/currency.ts": "Formats numbers as Indian Rupee currency strings using Intl.NumberFormat.",
  "frontend/src/lib/roleAccess.ts": "Defines role-based access control functions and utilities for checking user permissions across different operations.",
  "frontend/src/lib/units.ts": "Defines measurement units constant array and type for billing items (Rft, Sft, Cumt, Nos, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/analytics/AnalyticsPage.tsx": "Placeholder analytics page with a card indicating future features like trade-wise totals, top 3 summaries, and advanced filtering.",
  "frontend/src/pages/bills/BillFormDialog.tsx": "Dialog form for creating new bills with fields for project, contractor, date, trade, unit, pricing, quantity, description, and location, auto-populating trade from selected contractor.",
  "frontend/src/pages/bills/BillsPage.tsx": "Main bills listing page with table view showing all bills, role-based access controls for raising and deleting bills, and actions for viewing, editing, and deleting with password confirmation.",
  "frontend/src/pages/bills/BillViewDialog.tsx": "Read-only dialog displaying detailed bill information including bill number, status, project details, pricing breakdown, debits, and final amount.",
  "frontend/src/pages/contractors/ContractorFormDialog.tsx": "Dialog form for creating and editing contractors with fields for project, name, trade, unit, pricing, estimated quantity, contact details, and attachments, calculating estimated amount automatically.",
  "frontend/src/pages/contractors/ContractorsPage.tsx": "Main contractors management page with filtering by project/trade/name, table view of contractors, and actions for viewing, editing, and deleting contractors based on user role permissions.",
  "frontend/src/pages/contractors/ContractorViewDialog.tsx": "A read-only dialog component that displays detailed information about a contractor, including project association, trade details, pricing, contact information, and attachments.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Dashboard overview page displaying statistics cards for total bills, completed/pending payments, and total paid amount, with authentication check before showing data.",
  "frontend/src/pages/Deactivated.tsx": "Page displayed when a user's account is deactivated, showing an error message and logout button.",
  "frontend/src/pages/Login.tsx": "Login page component with Internet Identity authentication button and branding, optionally used as a modal.",
  "frontend/src/pages/nmr/NMRFormDialog.tsx": "Dialog form for creating weekly NMR (Non-Manpower Record) entries with project/contractor selection, week date range, and dynamic entry rows that auto-calculate amounts based on persons, rate, and hours.",
  "frontend/src/pages/nmr/NMRPage.tsx": "Main NMR management page displaying a table of weekly NMR records with view and delete actions, filtered by user role permissions for creating and deleting records.",
  "frontend/src/pages/nmr/NMRViewDialog.tsx": "Read-only dialog displaying detailed NMR information including project, contractor, week dates, engineer name, status, and a table of all labor entries with calculated amounts.",
  "frontend/src/pages/payments/PaymentFormDialog.tsx": "Dialog component for creating payments against approved bills, with form fields for bill selection, payment date, and amount, plus validation and balance calculation.",
  "frontend/src/pages/payments/PaymentsPage.tsx": "Main payments page displaying a table of all payments with filtering by role, supporting add/delete actions via dialogs and password-protected deletion.",
  "frontend/src/pages/ProfileLoadError.tsx": "Displays an error page when user profile cannot be loaded, offering logout functionality and explaining possible causes (account not created, missing permissions, system initializing).",
  "frontend/src/pages/ProfileSetup.tsx": "Profile setup form for new users to enter name, email, and mobile details, with restrictions that accounts must be created by administrators except for the main admin email.",
  "frontend/src/pages/projects/ProjectFormDialog.tsx": "Dialog component for creating and editing projects with fields for project details, client info, addresses, location links, budget, and status.",
  "frontend/src/pages/projects/ProjectsPage.tsx": "Main projects page with a table listing all projects, supporting view/edit/delete actions with role-based access control and password-protected deletion.",
  "frontend/src/pages/projects/ProjectViewDialog.tsx": "Read-only dialog displaying detailed project information including addresses, budget, dates, location links, and status badge.",
  "frontend/src/pages/users/UserFormDialog.tsx": "Dialog for creating and editing user accounts with fields for name, email, mobile, role selection, and active status toggle, with special handling for main admin users.",
  "frontend/src/pages/users/UsersPage.tsx": "Main users management page that displays a table of users with view, edit, and delete actions, using React Query hooks for data fetching and mutations. Includes refresh functionality and prevents deletion of main admin users.",
  "frontend/src/pages/users/UserViewDialog.tsx": "A dialog component that displays read-only user details including PayGo ID, name, email, mobile, role, status, and principal in a formatted layout.",
  "frontend/src/routes/RootLayout.tsx": "Root layout component that handles authentication flow, profile setup, user deactivation states, and displays appropriate banners for guest mode or loading states. Includes bootstrap logic for main admin setup.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata indicating a fix request for a known issue where the user list page only displays 2 users instead of all 7 added users."
}