{
  "backend/main.mo": "Main Motoko actor defining user, project, contractor, bill, NMR, and payment types with in‑memory maps and authorization/storage mixins.",
  "backend/migration.mo": "No-op migration module returning previous actor state.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests tied to two authentication-related features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark UI color tokens and layout styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring authentication, auto admin bootstrap, routing, and global providers.",
  "frontend/src/components/AppShell/AppShell.tsx": "Layout wrapper with sidebar and scrollable main content area.",
  "frontend/src/components/AppShell/RoleBadge.tsx": "Badge component mapping user roles to display labels and variants.",
  "frontend/src/components/AppShell/Sidebar.tsx": "Left sidebar with navigation items, role-based visibility, user info, and logout handling.",
  "frontend/src/components/dialogs/DeleteWithPasswordDialog.tsx": "A dialog component prompting users to enter a password before confirming a delete action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, users, projects, and other domain data.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme colors.",
  "frontend/src/lib/dates.ts": "Utility functions for adding days and formatting dates.",
  "frontend/src/lib/formatters/currency.ts": "Formats numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/lib/roleAccess.ts": "Helpers for checking user permissions and converting roles to and from strings.",
  "frontend/src/lib/units.ts": "Defines a constant list of measurement units and a Unit type.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/analytics/AnalyticsPage.tsx": "Static analytics placeholder page describing upcoming dashboard features.",
  "frontend/src/pages/bills/BillFormDialog.tsx": "Dialog component for creating bills with form fields, validation, and submission using createBill mutation.",
  "frontend/src/pages/bills/BillsPage.tsx": "Main bills listing page with table view, view/create/delete actions, and role‑based access.",
  "frontend/src/pages/bills/BillViewDialog.tsx": "Read‑only dialog that displays all bill details including pricing, status, and metadata.",
  "frontend/src/pages/contractors/ContractorFormDialog.tsx": "Dialog for creating or editing contractors with form state, validation, and create/update mutations.",
  "frontend/src/pages/contractors/ContractorsPage.tsx": "Contractors listing page with filters, view/edit/delete actions, and role‑based access control.",
  "frontend/src/pages/contractors/ContractorViewDialog.tsx": "Read‑only dialog showing full contractor details including project, pricing, and attachments.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Displays dashboard statistics for bills and payments and renders summary cards and recent activity info.",
  "frontend/src/pages/Deactivated.tsx": "Displays an account deactivation message with a logout button.",
  "frontend/src/pages/Login.tsx": "Login page with branding that triggers Internet Identity login.",
  "frontend/src/pages/nmr/NMRFormDialog.tsx": "Provides a dialog form to create weekly NMR records with dynamic entry rows and automatic amount calculation.",
  "frontend/src/pages/nmr/NMRPage.tsx": "Lists all NMR records with actions to create, view, and delete entries based on user permissions.",
  "frontend/src/pages/nmr/NMRViewDialog.tsx": "Shows a read‑only dialog displaying full NMR details including entries and calculated values.",
  "frontend/src/pages/payments/PaymentFormDialog.tsx": "Dialog form for creating payments tied to approved bills, calculating balances and validating input.",
  "frontend/src/pages/payments/PaymentsPage.tsx": "Displays a table of all payments with options to add or delete payments depending on user role.",
  "frontend/src/pages/ProfileSetup.tsx": "Form for creating and saving a new user profile using backend mutations.",
  "frontend/src/pages/projects/ProjectFormDialog.tsx": "Dialog form for creating or editing a project, handling field state, validation, and submit mutations.",
  "frontend/src/pages/projects/ProjectsPage.tsx": "Projects list page with table display, view/edit/delete actions, and dialogs for managing projects.",
  "frontend/src/pages/projects/ProjectViewDialog.tsx": "Read-only dialog that displays full project details including budget, dates, addresses, links, and status.",
  "frontend/src/pages/users/UserFormDialog.tsx": "Dialog form for creating or editing users with validation, role selection, and submit mutations.",
  "frontend/src/pages/users/UsersPage.tsx": "Users list page with table display, view/edit/delete actions, and dialogs for managing user accounts.",
  "frontend/src/pages/users/UserViewDialog.tsx": "Read-only dialog showing user details including role, status, and principal.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Contains the project’s architecture state, planned backend stack, role rules, IDs, and existing feature definitions for the PayGo system."
}