{
  "backend/main.mo": "Main actor defining all data types (UserProfile, Project, Contractor, Bill, NMR, Payment) and state maps, with mixins for authorization and storage, plus CRUD operations and role-based access control.",
  "backend/migration.mo": "Migration module that transforms OldActor schema to NewActor by adding pendingUsers map while preserving all existing state fields and removing deprecated nextPrincipalId.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing principal_id uniqueness in ProfileSetup, UserFormDialog, and useQueries hooks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files covering authentication, CRUD pages, dialogs, hooks, utilities, and components with focus on principal assignment and user management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color tokens for UI components, charts, and sidebar styling.",
  "frontend/index.html": "HTML entry point for the PayGo application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for all pages (dashboard, users, projects, contractors, bills, NMR, payments, analytics), wrapped with QueryClient, ThemeProvider, and error boundary.",
  "frontend/src/components/AppShell/AppShell.tsx": "Layout component providing fixed sidebar and scrollable main content area with optional banner slot for status messages.",
  "frontend/src/components/AppShell/RoleBadge.tsx": "Badge component displaying UserRole enum values with role-specific styling using switch statements and variant mapping.",
  "frontend/src/components/AppShell/Sidebar.tsx": "Sidebar navigation component that displays app logo, navigation menu items (Dashboard, Users, Projects, etc.), and user profile footer with logout functionality. Conditionally shows menu items based on user role and authentication status.",
  "frontend/src/components/CurrentInternetIdentityPanel.tsx": "Fixed-position panel component that displays the current Internet Identity principal with a copy-to-clipboard button. Shows 'Anonymous' when no identity is present.",
  "frontend/src/components/dialogs/DeleteWithPasswordDialog.tsx": "Alert dialog component for confirming deletion actions with password verification. Includes password input field and cancel/confirm actions.",
  "frontend/src/components/FatalErrorBoundary.tsx": "React error boundary class component that catches fatal errors and renders a fallback UI. Logs errors to console and displays FatalErrorFallback component when errors occur.",
  "frontend/src/components/FatalErrorFallback.tsx": "Error fallback UI component that displays error details in a card with an alert and a reload button. Used by FatalErrorBoundary to show user-friendly error messages.",
  "frontend/src/components/GuestModeBanner.tsx": "Banner component that displays an informational alert prompting guest users to sign in for full feature access. Includes a sign-in button callback.",
  "frontend/src/components/ProfileStatusBanner.tsx": "Reusable banner component that displays loading, error, or info states with appropriate icons and optional retry/logout actions. Supports three variants with different styling.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, including login/logout functionality, identity state, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data (user profiles, projects, contractors, bills, NMRs, payments). Includes current user profile queries and bootstrap admin mutation with detailed logging.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, destructive, etc.) and setting the base font family.",
  "frontend/src/lib/dates.ts": "Utility functions for date manipulation: addDays adds days to a date string, and formatDate formats dates in Indian locale (en-IN).",
  "frontend/src/lib/formatters/currency.ts": "Currency formatter function that formats numbers as Indian Rupees (INR) using Intl.NumberFormat.",
  "frontend/src/lib/roleAccess.ts": "Role-based access control utilities defining permissions for different user roles (admin, siteEngineer, projectManager, qc, billingEngineer, viewer) and helper functions to check permissions and convert role strings.",
  "frontend/src/lib/units.ts": "Defines a constant array of measurement units (Rft, Sft, Cuft, Rmt, Smt, Cumt, Pcs, Nos, Bundles, Ltr, Kg, Ton, Lumsum) and exports a Unit type.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/analytics/AnalyticsPage.tsx": "Placeholder analytics dashboard page with a card indicating future features like trade-wise totals and advanced filtering.",
  "frontend/src/pages/bills/BillFormDialog.tsx": "Dialog form for creating new bills with fields for project, contractor, date, trade, unit, price, quantity, description, and location, using React Query mutations.",
  "frontend/src/pages/bills/BillsPage.tsx": "Main bills page component that displays a table of bills with view, edit, and delete actions, filtered by user role permissions (canRaiseBill, canDelete, isViewer).",
  "frontend/src/pages/bills/BillViewDialog.tsx": "Read-only dialog displaying detailed bill information including bill number, status, project details, pricing, debits, and final amount in a formatted grid layout.",
  "frontend/src/pages/contractors/ContractorFormDialog.tsx": "Dialog form for creating and editing contractors with fields for project, trade, unit pricing, contact info, and attachments; calculates estimated amount from unit price and quantity.",
  "frontend/src/pages/contractors/ContractorsPage.tsx": "Main contractors page with filterable table (by project, trade, name) and CRUD actions, respecting user role permissions for editing and deletion.",
  "frontend/src/pages/contractors/ContractorViewDialog.tsx": "Read-only dialog that displays detailed contractor information including project, trade, pricing, contact details, and attachments.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Dashboard overview page showing statistics cards for total bills, completed/pending payments, and total paid amount; requires authentication to display data.",
  "frontend/src/pages/Deactivated.tsx": "Page displayed when a user's account is deactivated, showing an alert message and a logout button that clears identity and query cache.",
  "frontend/src/pages/Login.tsx": "Login page component with Internet Identity authentication, displaying the PayGo logo and login button with loading state handling.",
  "frontend/src/pages/nmr/NMRFormDialog.tsx": "Dialog form for creating weekly NMR (Non-Manual Register) records with dynamic entry rows that auto-calculate amounts from labour persons, rate, and hours.",
  "frontend/src/pages/nmr/NMRPage.tsx": "Main NMR (Non-Measured Record) page component that displays a table of weekly NMR records with create, view, and delete actions based on user role permissions.",
  "frontend/src/pages/nmr/NMRViewDialog.tsx": "Dialog component that displays detailed read-only view of an NMR record including project info, dates, engineer name, status, and a table of labor entries with amounts.",
  "frontend/src/pages/payments/PaymentFormDialog.tsx": "Dialog form for creating new payment records against approved bills, showing bill selection, payment date, amount input, and calculated balance.",
  "frontend/src/pages/payments/PaymentsPage.tsx": "Main payments page displaying a table of all payment records with details like payment ID, bill number, date, project, amounts, and delete actions based on user permissions.",
  "frontend/src/pages/ProfileLoadError.tsx": "Error page shown when user profile fails to load, explaining possible reasons (account not created, no permissions, system initializing) with a logout option.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile setup page for new users that calls completePendingUserSetup mutation to finalize account creation, with special handling for bootstrap admin email.",
  "frontend/src/pages/projects/ProjectFormDialog.tsx": "Dialog form for creating and editing projects with fields for project name, client, dates, budget, contact info, addresses, location links, notes, and status.",
  "frontend/src/pages/projects/ProjectsPage.tsx": "Main projects listing page with table view, CRUD operations (view/edit/delete), role-based access control, and project status badges. Includes dialogs for project form, view details, and password-protected deletion.",
  "frontend/src/pages/projects/ProjectViewDialog.tsx": "Dialog component that displays detailed read-only view of a project including all project information, formatted dates and currency, and clickable location links.",
  "frontend/src/pages/users/UserFormDialog.tsx": "Dialog component for creating and editing users with fields for name, email, mobile, role, and active status. Handles Internet Identity integration for new users and prevents modification of main admin users.",
  "frontend/src/pages/users/UsersPage.tsx": "Users management page with table listing, refresh functionality, and CRUD operations. Includes role-based access control, prevents deletion of main admin, and displays user count with debug logging.",
  "frontend/src/pages/users/UserViewDialog.tsx": "Read-only dialog displaying detailed user information including PayGo ID, contact details, role badge, active status, and principal ID in a formatted layout.",
  "frontend/src/routes/RootLayout.tsx": "Root layout component managing authentication flow, profile loading states, and routing logic. Handles login modal, profile setup for new users, deactivated user screens, and includes comprehensive logging for debugging profile fetch states with timeout protection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color tokens using OKLCH color space, extended theme settings including container, border radius, shadows, and accordion animations, plus typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for PayGo application documenting known issues with principal_id collisions causing user overwrites, and three feature requests to fix unique principal assignment, manual user creation, and user list queries."
}